{
    "Android Projects": [
        {
            "id": 1,
            "name": "Brain Tumor Detection",
            "description": "This innovative Android application leverages the power of machine learning to assist in the early detection of brain tumors. It's designed to be a user-friendly tool that empowers individuals to take a more proactive approach to their health.\n\nKey Features:\n\nMachine Learning Model: At the core of the app lies a sophisticated machine learning model trained on a vast dataset of brain scans. This model analyzes anonymized MRI or CT scan images uploaded by the user, searching for patterns indicative of potential tumors.\nSecure Image Upload: The app prioritizes user privacy. A secure connection ensures safe and encrypted transfer of medical images to the machine learning model.\nRisk Prediction: Following analysis, the app generates a risk score based on the model's prediction. It's important to understand that this is not a definitive diagnosis, but rather an indicator of potential risk.\nEducational Resources: The app provides informative content about brain tumors, including types, symptoms, and early detection methods. This empowers users to make informed decisions about their health.\nActionable Guidance: The app clearly outlines the next steps based on the risk score. For low-risk results, it might suggest scheduling routine check-ups. For higher-risk scores, it will strongly advise consulting a healthcare professional for further evaluation, potentially including an MRI or CT scan.\nAnonymity and Privacy: The app prioritizes user privacy. All uploaded medical images are anonymized before analysis by the machine learning model.\n\n:\n\nEarly Detection: Early detection is crucial for successful brain tumor treatment. This app can be a valuable tool for identifying potential tumors at an early stage, allowing for prompt medical intervention.\nPeace of Mind: The app empowers users to take charge of their health and gain valuable insights into potential brain tumor risks.\nAccessibility: This app makes brain tumor risk assessment more accessible, particularly for those who might not have immediate access to advanced medical facilities.\nImportant Disclaimers:\n\nNot a Diagnostic Tool: It's crucial to understand that this app is not a replacement for a qualified medical diagnosis. The risk score should be used in conjunction with a consultation with a healthcare professional.\nAccuracy: Machine learning models are constantly evolving, and accuracy can depend on various factors. The app will clearly communicate the limitations of the model's predictions.\nMedical Follow-Up: Regardless of the risk score, users are encouraged to schedule regular check-ups with their healthcare providers.\nConclusion:\n\nThis brain tumor detection app offers a promising approach to early detection. By leveraging machine learning technology, it empowers users to take a more proactive role in their health. Remember, this app should be used as a tool alongside consultations with qualified medical professionals.",
            "title_image": "./assets/images/project-1.jpg",
            "images": [],
            "link": "",
            "category": "android"
        },

        {
            "id": 2,
            "name": "Dynamic Island",
            "description": "",
            "title_image": "./assets/images/project-1.jpg",
            "images": [],
            "link": "",
            "category": "android"
        },

        {
            "id": 3,
            "name": "Mirror Camera Filter",
            "description": "",
            "title_image": "./assets/images/project-1.jpg",
            "images": [],
            "link": "",
            "category": "android"
        },

        {
            "id": 4,
            "name": "Screen Lock",
            "description": "",
            "title_image": "./assets/images/project-1.jpg",
            "images": [],
            "link": "",
            "category": "android"
        },

        {
            "id": 5,
            "name": "Pokedex",
            "description": "",
            "title_image": "./assets/images/project-1.jpg",
            "images": [],
            "link": "",
            "category": "android"
        },

        {
            "id": 6,
            "name": "Twitter Video Downloader",
            "description": "",
            "title_image": "./assets/images/project-1.jpg",
            "images": [],
            "link": "",
            "category": "android"
        },

        {
            "id": 7,
            "name": "Video Background Removal",
            "description": "",
            "title_image": "./assets/images/project-1.jpg",
            "images": [],
            "link": "",
            "category": "android"
        }
    ],

    "Machine Learning Projects":[
        {
            "id": 8,
            "name": "Titanic Survival Prediction",
            "description": "",
            "title_image": "./assets/images/project-1.jpg",
            "images": [],
            "link": "",
            "category": "ml"
        }
    ],

    "Web Projects":[
        {
            "id": 9,
            "name": "Weather App",
            "description": "",
            "title_image": "./assets/images/project-1.jpg",
            "images": [],
            "link": "",
            "category": "web"
        },

        {
            "id": 10,
            "name": "Solar System",
            "description": "",
            "title_image": "./assets/images/project-1.jpg",
            "images": [],
            "link": "",
            "category": "web"
        }
    ]
}